In [ ]:
print("hello")

In [5]:
import pandas as pd

In [7]:
s = pd.Series([4,6,8,2,9])
s

0    4
1    6
2    8
3    2
4    9
dtype: int64

In [8]:
s = pd.Series([4,6,8,2,9], index = ['a','b','c','d','e'])
s

a    4
b    6
c    8
d    2
e    9
dtype: int64

In [9]:
s.values

array([4, 6, 8, 2, 9])

In [10]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
s['a']

np.int64(4)

In [13]:
s[0:3]

a    4
b    6
c    8
dtype: int64

In [14]:
s[:-1]

a    4
b    6
c    8
d    2
dtype: int64

In [15]:
s[::-1]

e    9
d    2
c    8
b    6
a    4
dtype: int64

In [16]:
s[['b','c']]

b    6
c    8
dtype: int64

In [17]:
s['b'] = 10

In [18]:
s

a     4
b    10
c     8
d     2
e     9
dtype: int64

In [19]:
import numpy as np

In [20]:
arr = np.array([1,2,3,4,5])
s = pd.Series(arr)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
s[2] = -45
s

0     1
1     2
2   -45
3     4
4     5
dtype: int64

In [22]:
s[s>1]

1    2
3    4
4    5
dtype: int64

In [23]:
s[s<1]

2   -45
dtype: int64

In [24]:
s[s<=1]

0     1
2   -45
dtype: int64

In [25]:
s +1

0     2
1     3
2   -44
3     5
4     6
dtype: int64

In [26]:
s ** 2

0       1
1       4
2    2025
3      16
4      25
dtype: int64

In [27]:
s / 0

0    inf
1    inf
2   -inf
3    inf
4    inf
dtype: float64

In [28]:
s*0

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [29]:
s%2

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [30]:
s//2

0     0
1     1
2   -23
3     2
4     2
dtype: int64

In [31]:
s* 6

0      6
1     12
2   -270
3     24
4     30
dtype: int64

In [32]:
s+=4

In [33]:
s

0     5
1     6
2   -41
3     8
4     9
dtype: int64

In [34]:
s -= 4

In [35]:
s

0     1
1     2
2   -45
3     4
4     5
dtype: int64

In [36]:
s *= 3

In [37]:
s

0      3
1      6
2   -135
3     12
4     15
dtype: int64

In [38]:
s = pd.Series([1,2,3,2,4,3,3,])
s

0    1
1    2
2    3
3    2
4    4
5    3
6    3
dtype: int64

In [40]:
s.value_counts()

3    3
2    2
1    1
4    1
Name: count, dtype: int64

In [41]:
s.unique()

array([1, 2, 3, 4])

In [42]:
s.nunique()

4

In [43]:
s = pd.Series([1,2,3,None, 4,3,None])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    3.0
6    NaN
dtype: float64

In [44]:
s.count()

np.int64(5)

In [46]:
s = pd.Series([1,2,3,4])
s.is_unique

True

In [47]:
s = pd.Series([1,2,3,4,3,5])
s.is_unique

False

In [48]:
s = pd.Series([12,43,56,78,43,52])
s.idxmax()

3

In [49]:
s

0    12
1    43
2    56
3    78
4    43
5    52
dtype: int64

In [51]:
s.idxmin()

0

In [52]:
s = pd.Series([2,0,0,0])
s.any()

np.True_

In [53]:
s = pd.Series([2,0,0,0])
s.all()

np.False_

In [55]:
s = pd.Series([23,3,5,7])
s.all()

np.True_

In [56]:
s

0    23
1     3
2     5
3     7
dtype: int64

In [57]:
s.describe()

count     4.000000
mean      9.500000
std       9.146948
min       3.000000
25%       4.500000
50%       6.000000
75%      11.000000
max      23.000000
dtype: float64

In [59]:
s.mode

<bound method Series.mode of 0    23
1     3
2     5
3     7
dtype: int64>

In [60]:
s = pd.Series([3,4,5,4,3,1])
s.mode()

0    3
1    4
dtype: int64

In [61]:
s.mean()

np.float64(3.3333333333333335)

In [62]:
s.median()

np.float64(3.5)

In [63]:
s.std()

np.float64(1.3662601021279464)

In [1]:
import pandas as pd

In [4]:
data = {
    'name' : ['john', 'alice', 'bob'],
    'age' : [26,32,24]
}

df_user = pd.DataFrame(data)
df_user

    name  age
0   john   26
1  alice   32
2    bob   24

In [5]:
data = [
    ['alice', 25, 'delhi'],
    ['bob', 31, 'mumbai'],
    ['john', 21, 'nagpur']
]

df = pd.DataFrame(data)
df

       0   1       2
0  alice  25   delhi
1    bob  31  mumbai
2   john  21  nagpur

In [6]:
data = [
    ['alice', 25, 'delhi'],
    ['bob', 31, 'mumbai'],
    ['john', 21, 'nagpur']
]

df = pd.DataFrame(data, columns=['name', 'age', 'city']
                  )
df

    name  age    city
0  alice   25   delhi
1    bob   31  mumbai
2   john   21  nagpur

In [10]:
df = pd.read_csv('data.csv')
df

      name   age        city
0    alice    26   Hyderabad
1      bob    63      Mumbai
2  Carlson    43      Kanpur

In [12]:
df.columns

Index(['name', ' age', ' city'], dtype='object')

In [14]:
df.values

array([['alice', 26, ' Hyderabad'],
       ['bob', 63, ' Mumbai'],
       ['Carlson', 43, ' Kanpur']], dtype=object)

In [19]:
df.head()

      name   age        city
0    alice    26   Hyderabad
1      bob    63      Mumbai
2  Carlson    43      Kanpur

In [21]:
df.tail(1)

      name   age     city
2  Carlson    43   Kanpur

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1    age    3 non-null      int64
 2    city   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [25]:
df.describe()

             age
count   3.000000
mean   44.000000
std    18.520259
min    26.000000
25%    34.500000
50%    43.000000
75%    53.000000
max    63.000000

In [26]:
df['name']

0      alice
1        bob
2    Carlson
Name: name, dtype: object

In [31]:
df[' age']

0    26
1    63
2    43
Name:  age, dtype: int64

In [33]:
df.iloc[0]

name          alice
 age             26
 city     Hyderabad
Name: 0, dtype: object

In [34]:
df.iloc[2]

name     Carlson
 age          43
 city     Kanpur
Name: 2, dtype: object

In [41]:
df.loc[0, ' city']

' Hyderabad'

In [42]:
df.iloc[0,0]

'alice'

In [43]:
df.iloc[1,2]

' Mumbai'

In [44]:
df.iloc[2,1]

np.int64(43)

In [51]:
df['salary'] = [40000, 30000, 26000]
df

      name   age        city  salary
0    alice    26   Hyderabad   40000
1      bob    63      Mumbai   30000
2  Carlson    43      Kanpur   26000

In [52]:
df.drop('salary', axis =1, inplace=True)

In [53]:
df

      name   age        city
0    alice    26   Hyderabad
1      bob    63      Mumbai
2  Carlson    43      Kanpur

In [58]:
df1 = {
    'name': 'Karl',
    'age' : 45,
    'city' : 'Pune'
}
df1

{'name': 'Karl', 'age': 45, 'city': 'Pune'}

In [59]:
df3 = pd.DataFrame(df1)

df2 = pd.concat([df,df3], ignore_index=True)
df2

ValueError: If using all scalar values, you must pass an index

In [60]:
df.drop(0)

      name   age     city
1      bob    63   Mumbai
2  Carlson    43   Kanpur

In [65]:
df.at[0,' age'] = 12
df

      name   age        city   age
0    alice    12   Hyderabad  12.0
1      bob    63      Mumbai   NaN
2  Carlson    43      Kanpur   NaN

In [73]:
df.loc[df['name'] == 'alice', ' city'] = 'jaipur'
df

      name     city   age    city
0    alice   jaipur  12.0  jaipur
1      bob   Mumbai   NaN     NaN
2  Carlson   Kanpur   NaN     NaN

In [74]:
filtered_df = df[df[' age'] > 35]
filtered_df

KeyError: ' age'

In [75]:
df.sort_values(' age', ascending=True, inplace= True)

KeyError: ' age'